#include <stdio.h>

int main() {

	//버블 정렬 - 인접한 요소와 비교해서 교환하여 정렬함
	//왼쪽이 작은수, 오른쪽을 큰수로(오름차순)
	int a[5] = { 3, 2, 5, 1, 4 };
	int i, j, temp;  //temp - 교환을 위한 임시변수

	//for (i = 0; i < 5; i++) {
	//	for (j = 0; j < 4; j++) {
	//		if (a[j] > a[j + 1]) {  //오름 차순
	//			temp = a[j];
	//			a[j] = a[j + 1];
	//			a[j + 1] = temp;
	//		}
	//	}
	//}

	/*
						3, 2, 5, 1, 4
		i=0, j=0, 3>2   2, 3, 5, 1, 4
			 j=1, 3>5   2, 3, 5, 1, 4
			 j=2, 5>1	2, 3, 1, 5, 4
			 j=3, 5>4   2, 3, 1, 4, 5
		i=1, j=0, 2>3   2, 3, 1, 4, 5
			 j=1, 3>1	2, 1, 3, 4, 5
			 j=2, 3>4	2, 1, 3, 4, 5
			 j=3, 4>5	2, 1, 3, 4, 5
		i=2, j=0, 2>1	1, 2, 3, 4, 5
	*/
	//for (i = 0; i < 5; i++) {
	//	printf("%-2d", a[i]);

	}

	//상태 변수 사용
	int sw = 0;  //교환없음 - 0, 교환있음 - 1
	for (i = 0; i < 5; i++) {
		for (j = 0; j < 4; j++) {
			if (a[j] > a[j + 1]) {  //오름 차순
				temp = a[j];
				a[j] = a[j + 1];
				a[j + 1] = temp;
			}
			sw = 1;
		}
	}

	if (sw == 0) {
		printf("교환없음\n");
	}

	//출력
	for (i = 0; i < 5; i++) {
		printf("%-2d", a[i]);

	return 0;
}